In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
db_warehouse = create_engine('postgresql://marcel:4UTebmZgDs7Hyfsq@warehouse:5432/warehouse')
db_replication = create_engine('postgresql://francois:4RzVZ2JmndK@db-slave2:5432/lottostar')

In [2]:
sql_query="""
select	date(created_at) as withdraw_date,
		sum(transaction_cash) as transaction_cash,
        sum(play_credits_withdrawn) as play_credits_withdrawn,
        sum(cash) as cash
from auth_playcreditswithdrawal
		where cancellation_timestamp is null and approval_status = 4 and
        created_at > now() - interval '30 days' and created_at < now() - interval '1 hour'
        group by 1;
"""

In [3]:
df1 = pd.read_sql_query(sql_query, con=db_warehouse)
df2 = pd.read_sql_query(sql_query, con=db_replication)
df1 = df1.sort_values(by=['withdraw_date'])
df2 = df2.sort_values(by=['withdraw_date'])

In [4]:
df1.head()

   withdraw_date  transaction_cash  play_credits_withdrawn      cash
25    2018-05-16           7608.62                75025.19  75025.19
28    2018-05-17          15962.12                61080.00  61080.00
13    2018-05-18           8070.00                26257.00  26257.00
20    2018-05-19           5429.50                21775.00  21775.00
27    2018-05-20          13723.10                14007.50  14007.50

In [5]:
df2.head()

   withdraw_date  transaction_cash  play_credits_withdrawn      cash
16    2018-05-16           7608.62                75025.19  75025.19
12    2018-05-17          15962.12                61080.00  61080.00
3     2018-05-18           8070.00                26257.00  26257.00
25    2018-05-19           5429.50                21775.00  21775.00
10    2018-05-20          13723.10                14007.50  14007.50

In [6]:
df1['play_credits_withdrawn'].sum() == df2['play_credits_withdrawn'].sum()

True

In [7]:
df1['transaction_cash'].sum() == df2['transaction_cash'].sum()

True